[Survived] BooleanLiteral
src/components/app-badge/AppBadge.tsx:9:15
 
 const AppBadge = ({
   className,
-  isRounded = true,
+  isRounded = false,
   size = "medium",
   variant = "contained",

[Killed] BlockStatement
src/components/app-badge/AppBadge.tsx:14:22
   variant = "contained",
   children,
   ...props
-}: AppBadgeProps) => {
-  return (
-    <Badge
-      className={cn(
-        "spa-badge",
-        `spa-badge__${variant}`,
-        `spa-badge__${size}`,
-        !isRounded && "spa-badge__no-rounded",
-        !children && "spa-badge__no-children",
-        className
-      )}
-      {...props}
-    >
-      {children}
-    </Badge>
-  );
-};
+}: AppBadgeProps) => {};
 
 export default AppBadge;
killedBy: AppBadge renders AppBadge component
statusReason: TestingLibraryElementError: Unable to find an element with the text: children. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/app-badge/AppBadge.tsx:21:9
         "spa-badge",
         `spa-badge__${variant}`,
         `spa-badge__${size}`,
-        !isRounded && "spa-badge__no-rounded",
+        isRounded && "spa-badge__no-rounded",
         !children && "spa-badge__no-children",
         className
killedBy: AppBadge applies the no-round class when isRounded is false
statusReason: Error: expect(element).toHaveClass("spa-badge__no-rounded")

Expected the element to have class:
  spa-badge__no-rounded
Received:
  MuiBadge-root spa-badge spa-badge__contained spa-badge__medium css-1c32n2y-MuiBadge-root

[Killed] ConditionalExpression
src/components/app-badge/AppBadge.tsx:21:9
         "spa-badge",
         `spa-badge__${variant}`,
         `spa-badge__${size}`,
-        !isRounded && "spa-badge__no-rounded",
+        true,
         !children && "spa-badge__no-children",
         className
killedBy: AppBadge applies the no-round class when isRounded is false
statusReason: Error: expect(element).toHaveClass("spa-badge__no-rounded")

Expected the element to have class:
  spa-badge__no-rounded
Received:
  MuiBadge-root spa-badge spa-badge__contained spa-badge__medium css-1c32n2y-MuiBadge-root

[Survived] BooleanLiteral
src/components/app-badge/AppBadge.tsx:22:9
         `spa-badge__${variant}`,
         `spa-badge__${size}`,
         !isRounded && "spa-badge__no-rounded",
-        !children && "spa-badge__no-children",
+        children && "spa-badge__no-children",
         className
       )}

[Survived] ConditionalExpression
src/components/app-badge/AppBadge.tsx:22:9
         `spa-badge__${variant}`,
         `spa-badge__${size}`,
         !isRounded && "spa-badge__no-rounded",
-        !children && "spa-badge__no-children",
+        true,
         className
       )}
