[Killed] BlockStatement
src/components/app-box/AppBox.tsx:7:80
 type AppBoxProps<TElement> = BoxProps & HTMLProps<TElement>;
 
 const AppBox = forwardRef(
-  <TElement,>(props: AppBoxProps<TElement>, ref: ForwardedRef<HTMLElement>) => {
-    return <Box ref={ref} {...props} />;
-  }
+  <TElement,>(props: AppBoxProps<TElement>, ref: ForwardedRef<HTMLElement>) => {}
 );
 
killedBy: renders Header correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: login.label. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
