[Killed] BlockStatement
src/components/app-button/AppButton.tsx:31:23
   disabled,
   isLoading,
   ...props
-}: AppButtonProps) => {
-  const isDisabled = disabled || isLoading;
-
-  const loader = isLoading && <AppLoader variant="disabled" size="small" />;
-
-  return (
-    <Button
-      disabled={isDisabled}
-      className={cn(
-        "spa-button",
-        `spa-button__${variant}`,
-        `spa-button__${size}`,
-        className
-      )}
-      {...props}
-    >
-      {children}
-      {loader}
-    </Button>
-  );
-};
+}: AppButtonProps) => {};
 
 export default AppButton;
killedBy: renders Header correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: login.label. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
      data-scroll-handle="true"

[Killed] LogicalOperator
src/components/app-button/AppButton.tsx:32:22
   isLoading,
   ...props
 }: AppButtonProps) => {
-  const isDisabled = disabled || isLoading;
+  const isDisabled = disabled && isLoading;
 
   const loader = isLoading && <AppLoader variant="disabled" size="small" />;
killedBy: AppButton is disabled when isLoading is true
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:

[Killed] ConditionalExpression
src/components/app-button/AppButton.tsx:32:22
   isLoading,
   ...props
 }: AppButtonProps) => {
-  const isDisabled = disabled || isLoading;
+  const isDisabled = false;
 
   const loader = isLoading && <AppLoader variant="disabled" size="small" />;
killedBy: AppButton is disabled when isLoading is true
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:

[Killed] ConditionalExpression
src/components/app-button/AppButton.tsx:34:18
 }: AppButtonProps) => {
   const isDisabled = disabled || isLoading;
 
-  const loader = isLoading && <AppLoader variant="disabled" size="small" />;
+  const loader = true;
 
   return (
killedBy: renders Header correctly
statusReason: Error: Expected test not to call console.error().

If the error is expected, test for it explicitly by mocking it out using jest.spyOn(console, 'error').mockImplementation() and test that the warning occurs.

Warning: Failed prop type: Invalid prop `children` supplied to `ForwardRef(Button)`, expected a ReactNode.

[Killed] LogicalOperator
src/components/app-button/AppButton.tsx:34:18
 }: AppButtonProps) => {
   const isDisabled = disabled || isLoading;
 
-  const loader = isLoading && <AppLoader variant="disabled" size="small" />;
+  const loader = isLoading || <AppLoader variant="disabled" size="small" />;
 
   return (
killedBy: AppButton is disabled when isLoading is true
statusReason: Error: Expected test not to call console.error().

If the error is expected, test for it explicitly by mocking it out using jest.spyOn(console, 'error').mockImplementation() and test that the warning occurs.

Warning: Failed prop type: Invalid prop `children` supplied to `ForwardRef(Button)`, expected a ReactNode.
