[Killed] BlockStatement
src/components/app-container/AppContainer.tsx:5:52
 
 export type AppContainerProps = ContainerProps;
 
-const AppContainer = (props: AppContainerProps) => {
-  return <Container {...props} />;
-};
+const AppContainer = (props: AppContainerProps) => {};
 
 export default AppContainer;
killedBy: BestSellers component Should render bestSellers header
statusReason: TestingLibraryElementError: Unable to find an element with the text: /bestSellers.header/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
