[Killed] BlockStatement
src/components/app-icon-button/AppIconButton.tsx:9:54
   MuiLinkProps &
   Partial<ReactRouterDomLinkProps>;
 
-const AppIconButton = (props: AppIconButtonProps) => {
-  return <IconButton {...props} />;
-};
+const AppIconButton = (props: AppIconButtonProps) => {};
 
 export default AppIconButton;
killedBy: AppIconButton renders correctly
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>
