[Killed] BlockStatement
src/components/app-link/AppLink.tsx:17:37
 import "@/components/app-link/AppLink.scss";
 
 const NavLinkWrapper = forwardRef<HTMLAnchorElement, NavLinkProps>(
-  ({ className, ...props }, ref) => {
-    const classNameCallback = ({ isActive }: NavLinkRenderProps) =>
-      cn(className, isActive && "spa-link--active");
-
-    return <NavLink ref={ref} className={classNameCallback} {...props} />;
-  }
+  ({ className, ...props }, ref) => {}
 );
 
killedBy: AppLink adds active class when link's pathname is equal to location pathname
statusReason: TestingLibraryElementError: Unable to find an element with the text: Link1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/app-link/AppLink.tsx:18:31
 
 const NavLinkWrapper = forwardRef<HTMLAnchorElement, NavLinkProps>(
   ({ className, ...props }, ref) => {
-    const classNameCallback = ({ isActive }: NavLinkRenderProps) =>
-      cn(className, isActive && "spa-link--active");
+    const classNameCallback = () => undefined;
 
     return <NavLink ref={ref} className={classNameCallback} {...props} />;
killedBy: AppLink adds active class when link's pathname is equal to location pathname
statusReason: Error: expect(element).toHaveClass("spa-link--active")

Expected the element to have class:
  spa-link--active
Received:

[Killed] LogicalOperator
src/components/app-link/AppLink.tsx:19:21
 const NavLinkWrapper = forwardRef<HTMLAnchorElement, NavLinkProps>(
   ({ className, ...props }, ref) => {
     const classNameCallback = ({ isActive }: NavLinkRenderProps) =>
-      cn(className, isActive && "spa-link--active");
+      cn(className, isActive || "spa-link--active");
 
     return <NavLink ref={ref} className={classNameCallback} {...props} />;
killedBy: AppLink adds active class when link's pathname is equal to location pathname
statusReason: Error: expect(element).toHaveClass("spa-link--active")

Expected the element to have class:
  spa-link--active
Received:
  MuiTypography-root MuiTypography-inherit MuiLink-root MuiLink-underlineAlways spa-link spa-link__default css-1xylxj1-MuiTypography-root-MuiLink-root

[Killed] ConditionalExpression
src/components/app-link/AppLink.tsx:19:21
 const NavLinkWrapper = forwardRef<HTMLAnchorElement, NavLinkProps>(
   ({ className, ...props }, ref) => {
     const classNameCallback = ({ isActive }: NavLinkRenderProps) =>
-      cn(className, isActive && "spa-link--active");
+      cn(className, false);
 
     return <NavLink ref={ref} className={classNameCallback} {...props} />;
killedBy: AppLink adds active class when link's pathname is equal to location pathname
statusReason: Error: expect(element).toHaveClass("spa-link--active")

Expected the element to have class:
  spa-link--active
Received:
  MuiTypography-root MuiTypography-inherit MuiLink-root MuiLink-underlineAlways spa-link spa-link__default css-1xylxj1-MuiTypography-root-MuiLink-root

[Survived] BooleanLiteral
src/components/app-link/AppLink.tsx:29:15
 
 const AppLink = ({
   variant = "default",
-  isNavLink = false,
+  isNavLink = true,
   ...props
 }: AppLinkProps) => {

[Killed] BlockStatement
src/components/app-link/AppLink.tsx:31:21
   variant = "default",
   isNavLink = false,
   ...props
-}: AppLinkProps) => {
-  const component = isNavLink ? NavLinkWrapper : ReactRouterDomLink;
-
-  return (
-    <MuiLink
-      component={component}
-      className={cn("spa-link", `spa-link__${variant}`)}
-      {...props}
-    />
-  );
-};
+}: AppLinkProps) => {};
 
 export default AppLink;
killedBy: BestSellers component Should render product cards when data is available
statusReason: Error: Unable to find role="link"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiContainer-root MuiContainer-maxWidthXl spa-best-sellers css-19r6kue-MuiContainer-root"
    >
