[Killed] BlockStatement
src/components/app-loader/AppLoader.tsx:12:23
   size = "medium",
   variant = "contained",
   ...props
-}: AppLoaderProps) => {
-  return (
-    <CircularProgress
-      className={cn(
-        "spa-loader",
-        `spa-loader__${variant}`,
-        `spa-loader__${size}`,
-        className
-      )}
-      {...props}
-    />
-  );
-};
+}: AppLoaderProps) => {};
 
 export default AppLoader;
killedBy: AppLoader renders AppLoader props
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "progressbar"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body
