[Killed] BlockStatement
src/components/app-logo/AppLogo.tsx:13:55
   "component" | "src" | "alt"
 >;
 
-const AppLogo = ({ className, ...props }: AppLogo) => {
-  return (
-    <AppBox
-      component={COMPONENT}
-      src={logo}
-      alt="App logo"
-      className={cn("spa-logo", className)}
-      {...props}
-    />
-  );
-};
+const AppLogo = ({ className, ...props }: AppLogo) => {};
 
 export default AppLogo;
killedBy: HeaderToolbar renders the logo
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: App logo

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="header__wrapper MuiBox-root css-0"
    >
