[Killed] BlockStatement
src/components/app-snackbar/AppSnackbar.tsx:7:39
 
 import "@/components/app-snackbar/AppSnackbar.scss";
 
-export default function AppSnackbar() {
-  const { isOpen, config, closeSnackbar } = useSnackbar();
-  const { message, variant } = config;
-
-  return (
-    <Snackbar
-      anchorOrigin={{ horizontal: "center", vertical: "top" }}
-      open={isOpen}
-      onClose={closeSnackbar}
-      className="spa-snackbar"
-    >
-      <Alert
-        onClose={closeSnackbar}
-        severity={variant}
-        variant="filled"
-        className="spa-snackbar__alert"
-      >
-        {message}
-      </Alert>
-    </Snackbar>
-  );
-}
+export default function AppSnackbar() {}
 
killedBy: AppSnackbar renders correctly
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
src/components/app-snackbar/AppSnackbar.tsx:13:21
 
   return (
     <Snackbar
-      anchorOrigin={{ horizontal: "center", vertical: "top" }}
+      anchorOrigin={{}}
       open={isOpen}
       onClose={closeSnackbar}
killedBy: AppSnackbar renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'isOpen')
