[Killed] BlockStatement
src/components/app-typography/AppTypography.tsx:37:64
       }
   );
 
-function getDefaultComponentTag(variant: AppTypographyVariant) {
-  if (variant.startsWith("h")) {
-    return variant as HeadingVariant;
-  }
-
-  if (variant.startsWith("caption")) {
-    return "span";
-  }
-
-  return "p";
-}
+function getDefaultComponentTag(variant: AppTypographyVariant) {}
 
 const AppTypography = <T extends ElementType = "span">({
killedBy: Test Footer component Should render three sections and links lists
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading"

Here are the accessible roles:

  contentinfo:

  Name "":
  <footer

[Killed] ConditionalExpression
src/components/app-typography/AppTypography.tsx:38:7
   );
 
 function getDefaultComponentTag(variant: AppTypographyVariant) {
-  if (variant.startsWith("h")) {
+  if (true) {
     return variant as HeadingVariant;
   }
killedBy: BestSellers component Should render bestSellers header
statusReason: Error: Expected test not to call console.error().

If the error is expected, test for it explicitly by mocking it out using jest.spyOn(console, 'error').mockImplementation() and test that the warning occurs.

Warning: validateDOMNesting(...): <body> cannot appear as a child of <div>.

[Killed] MethodExpression
src/components/app-typography/AppTypography.tsx:38:7
   );
 
 function getDefaultComponentTag(variant: AppTypographyVariant) {
-  if (variant.startsWith("h")) {
+  if (variant.endsWith("h")) {
     return variant as HeadingVariant;
   }
killedBy: Test Footer component Should render three sections and links lists
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading"

Here are the accessible roles:

  contentinfo:

  Name "":
  <footer

[Killed] ConditionalExpression
src/components/app-typography/AppTypography.tsx:42:7
     return variant as HeadingVariant;
   }
 
-  if (variant.startsWith("caption")) {
+  if (true) {
     return "span";
   }
killedBy: AppTypography should render <p> by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "P"
Received: "SPAN"

[Killed] ConditionalExpression
src/components/app-typography/AppTypography.tsx:42:7
     return variant as HeadingVariant;
   }
 
-  if (variant.startsWith("caption")) {
+  if (false) {
     return "span";
   }
killedBy: AppTypography should render caption as <span> by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SPAN"
Received: "P"

[Killed] BlockStatement
src/components/app-typography/AppTypography.tsx:57:30
   translationKey,
   translationProps,
   ...props
-}: AppTypographyProps<T>) => {
-  const TypographyContent = translationKey ? (
-    <FormattedMessage id={translationKey} {...translationProps} />
-  ) : (
-    children
-  );
-
-  return (
-    <Typography
-      component={component ?? getDefaultComponentTag(variant)}
-      className={cn(`spa-typography`, `spa-typography__${variant}`, className)}
-      {...props}
-    >
-      {TypographyContent}
-    </Typography>
-  );
-};
+}: AppTypographyProps<T>) => {};
 
 export default AppTypography;
killedBy: Test Footer component Should render three sections and links lists
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading"

Here are the accessible roles:

  contentinfo:

  Name "":
  <footer

[Killed] LogicalOperator
src/components/app-typography/AppTypography.tsx:66:18
 
   return (
     <Typography
-      component={component ?? getDefaultComponentTag(variant)}
+      component={component && getDefaultComponentTag(variant)}
       className={cn(`spa-typography`, `spa-typography__${variant}`, className)}
       {...props}
killedBy: Test Footer component Should render three sections and links lists
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading"

Here are the accessible roles:

  contentinfo:

  Name "":
  <footer
