[Killed] BlockStatement
src/context/I18nProvider.tsx:9:65
   children: ReactNode;
 };
 
-const I18nProivider: FC<I18nProividerProps> = ({ children }) => {
-  return (
-    <IntlProvider locale="en" defaultLocale="en" messages={messages.en}>
-      {children}
-    </IntlProvider>
-  );
-};
+const I18nProivider: FC<I18nProividerProps> = ({ children }) => {};
 
 export default I18nProivider;
killedBy: Test Footer component Should render footer component
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "contentinfo"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body
