[Killed] BlockStatement
src/hooks/use-interval-switcher/useIntervalSwitcher.ts:3:70
 import { useEffect, useState } from "react";
 
-const useIntervalSwitcher = (length: number, intervalTime = 6000) => {
-  const [currentIndex, setCurrentIndex] = useState(0);
-
-  useEffect(() => {
-    const interval = setInterval(() => {
-      setCurrentIndex((prevIndex) => (prevIndex + 1) % length);
-    }, intervalTime);
-
-    return () => clearInterval(interval);
-  }, [length, intervalTime]);
-
-  return currentIndex;
-};
+const useIntervalSwitcher = (length: number, intervalTime = 6000) => {};
 
 export default useIntervalSwitcher;
killedBy: useIntervalSwitcher renders useIntervalSwitcher correctly with 100ms delay
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/hooks/use-interval-switcher/useIntervalSwitcher.ts:6:19
 const useIntervalSwitcher = (length: number, intervalTime = 6000) => {
   const [currentIndex, setCurrentIndex] = useState(0);
 
-  useEffect(() => {
-    const interval = setInterval(() => {
-      setCurrentIndex((prevIndex) => (prevIndex + 1) % length);
-    }, intervalTime);
-
-    return () => clearInterval(interval);
-  }, [length, intervalTime]);
+  useEffect(() => {}, [length, intervalTime]);
 
   return currentIndex;
killedBy: useIntervalSwitcher renders useIntervalSwitcher correctly with 100ms delay
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/hooks/use-interval-switcher/useIntervalSwitcher.ts:7:40
   const [currentIndex, setCurrentIndex] = useState(0);
 
   useEffect(() => {
-    const interval = setInterval(() => {
-      setCurrentIndex((prevIndex) => (prevIndex + 1) % length);
-    }, intervalTime);
+    const interval = setInterval(() => {}, intervalTime);
 
     return () => clearInterval(interval);
killedBy: useIntervalSwitcher renders useIntervalSwitcher correctly with 100ms delay
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/hooks/use-interval-switcher/useIntervalSwitcher.ts:8:23
 
   useEffect(() => {
     const interval = setInterval(() => {
-      setCurrentIndex((prevIndex) => (prevIndex + 1) % length);
+      setCurrentIndex(() => undefined);
     }, intervalTime);
 
killedBy: useIntervalSwitcher renders useIntervalSwitcher correctly with 100ms delay
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
src/hooks/use-interval-switcher/useIntervalSwitcher.ts:8:39
 
   useEffect(() => {
     const interval = setInterval(() => {
-      setCurrentIndex((prevIndex) => (prevIndex + 1) % length);
+      setCurrentIndex((prevIndex) => (prevIndex - 1) % length);
     }, intervalTime);
 
killedBy: useIntervalSwitcher renders useIntervalSwitcher correctly with 100ms delay
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1
