[Killed] ConditionalExpression
src/layouts/best-sellers/BestSellers.tsx:14:7
 const BestSellers = () => {
   const { data: products, isLoading } = useGetProductsQuery();
 
-  if (isLoading) return <AppTypography>Loading...</AppTypography>;
+  if (true) return <AppTypography>Loading...</AppTypography>;
 
   const productCards = products
killedBy: BestSellers component Should render bestSellers header
statusReason: TestingLibraryElementError: Unable to find an element with the text: /bestSellers.header/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p
      class="MuiTypography-root MuiTypography-body1 spa-typography spa-typography

[Killed] ConditionalExpression
src/layouts/best-sellers/BestSellers.tsx:14:7
 const BestSellers = () => {
   const { data: products, isLoading } = useGetProductsQuery();
 
-  if (isLoading) return <AppTypography>Loading...</AppTypography>;
+  if (false) return <AppTypography>Loading...</AppTypography>;
 
   const productCards = products
killedBy: BestSellers component Should render loader if isLoading
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Loading/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiContainer-root MuiContainer-maxWidthXl spa-best-sellers css-19r6kue-MuiCon

[Killed] MethodExpression
src/layouts/best-sellers/BestSellers.tsx:17:7
   if (isLoading) return <AppTypography>Loading...</AppTypography>;
 
   const productCards = products
-    ? products
-        .slice(0, 5)
+    ? products
         .map((product) => <ProductCard key={product.id} product={product} />)
     : null;
killedBy: BestSellers component Should render product cards when data is available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 8

[Killed] ArrowFunction
src/layouts/best-sellers/BestSellers.tsx:19:14
   const productCards = products
     ? products
         .slice(0, 5)
-        .map((product) => <ProductCard key={product.id} product={product} />)
+        .map(() => undefined)
     : null;
 
killedBy: BestSellers component Should render product cards when data is available
statusReason: Error: Unable to find role="link"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiContainer-root MuiContainer-maxWidthXl spa-best-sellers css-19r6kue-MuiContainer-root"
    >
