[Killed] BlockStatement
src/layouts/call-to-action/CallToAction.tsx:7:28
 
 import "@/layouts/call-to-action/CallToAction.scss";
 
-const CallToAction = () => {
-  return (
-    <AppBox className="call-to-action">
-      {callToActionItems.map((itemData) => (
-        <CallToActionItem key={itemData.titleTranslationKey} {...itemData} />
-      ))}
-    </AppBox>
-  );
-};
+const CallToAction = () => {};
 
 export default CallToAction;
killedBy: CallToAction renders correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /callToAction\..+\.title/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/layouts/call-to-action/CallToAction.tsx:10:30
 const CallToAction = () => {
   return (
     <AppBox className="call-to-action">
-      {callToActionItems.map((itemData) => (
-        <CallToActionItem key={itemData.titleTranslationKey} {...itemData} />
-      ))}
+      {callToActionItems.map(() => undefined)}
     </AppBox>
   );
killedBy: CallToAction renders correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /callToAction\..+\.title/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="call-to-action MuiBox-root css-0"
    />
