[Killed] BlockStatement
src/layouts/category-section/CategorySection.tsx:8:31
 
 import "@/layouts/category-section/CategorySection.scss";
 
-const CategorySection = () => {
-  const categoryItems = categoryData.map((element) => (
-    <CategoryItem
-      key={element.id}
-      label={element.label}
-      image={element.image}
-    />
-  ));
-
-  return (
-    <AppBox className="spa-category-section">
-      <AppTypography
-        translationKey="categorySection.title"
-        variant="h3"
-        className="spa-category-section__title"
-      />
-      <AppBox className="spa-category-section__container">
-        {categoryItems}
-      </AppBox>
-    </AppBox>
-  );
-};
+const CategorySection = () => {};
 
 export default CategorySection;
killedBy: Category section renders three category elements correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spa-category-section-item"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/layouts/category-section/CategorySection.tsx:9:42
 import "@/layouts/category-section/CategorySection.scss";
 
 const CategorySection = () => {
-  const categoryItems = categoryData.map((element) => (
-    <CategoryItem
-      key={element.id}
-      label={element.label}
-      image={element.image}
-    />
-  ));
+  const categoryItems = categoryData.map(() => undefined);
 
   return (
killedBy: Category section renders three category elements correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spa-category-section-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="spa-category-section MuiBox-root css-0"
    >
