[Killed] BlockStatement
layouts/category-section/components/CategoryItem.tsx:9:63
   image: string;
 };
 
-const CategoryItem = ({ label, image }: CategoryItemProps) => {
-  return (
-    <AppBox
-      className="spa-category-section__element"
-      data-testid="spa-category-section-item"
-    >
-      <AppBox
-        component="img"
-        src={image}
-        className="spa-category-section__image"
-      />
-      <AppTypography
-        translationKey={label}
-        variant="subtitle2"
-        className="spa-category-section__label"
-      />
-    </AppBox>
-  );
-};
+const CategoryItem = ({ label, image }: CategoryItemProps) => {};
 
 export default CategoryItem;
killedBy: Category section renders three category elements correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spa-category-section-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="spa-category-section MuiBox-root css-0"
    >
