[Killed] BlockStatement
header/components/header-categories/HeaderCategories.tsx:10:32
 
 import "@/layouts/header/components/header-categories/HeaderCategories.scss";
 
-const HeaderCategories = () => {
-  return (
-    <AppBox className="menu">
-      <AppContainer maxWidth="xl" className="menu__container">
-        {categories.map((category) => (
-          <AppLink
-            to={category.href}
-            variant="colored"
-            isNavLink
-            key={category.label}
-          >
-            <AppTypography variant="caption" data-testid="menu-item">
-              {category.label}
-            </AppTypography>
-          </AppLink>
-        ))}
-      </AppContainer>
-    </AppBox>
-  );
-};
+const HeaderCategories = () => {};
 
 export default HeaderCategories;
killedBy: HeaderCategories renders categories correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="menu-item"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
header/components/header-categories/HeaderCategories.tsx:14:25
   return (
     <AppBox className="menu">
       <AppContainer maxWidth="xl" className="menu__container">
-        {categories.map((category) => (
-          <AppLink
-            to={category.href}
-            variant="colored"
-            isNavLink
-            key={category.label}
-          >
-            <AppTypography variant="caption" data-testid="menu-item">
-              {category.label}
-            </AppTypography>
-          </AppLink>
-        ))}
+        {categories.map(() => undefined)}
       </AppContainer>
     </AppBox>
killedBy: HeaderCategories renders categories correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="menu-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="menu MuiBox-root css-0"
    >
