[Killed] BlockStatement
src/layouts/header/Header.tsx:9:22
 
 import "@/layouts/header/Header.scss";
 
-const Header = () => {
-  const { headerRef, scrollHandleRef } = useStickyHeader();
-
-  return (
-    <>
-      <AppBox ref={scrollHandleRef} data-scroll-handle />
-      <AppBox ref={headerRef} className="header">
-        <HeaderToolbar />
-        <HeaderCategories />
-      </AppBox>
-    </>
-  );
-};
+const Header = () => {};
 
 export default Header;
killedBy: renders Header correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: login.label. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
