[Survived] BlockStatement
header/hooks/use-sticky-header/useStickyHeader.ts:7:19
   const headerRef = useRef<HTMLDivElement | null>(null);
   const scrollHandleRef = useRef<HTMLDivElement | null>(null);
 
-  useEffect(() => {
-    const headerElement = headerRef.current;
-    const targetElement = scrollHandleRef.current;
-
-    if (!headerElement || !targetElement) {
-      return;
-    }
-
-    const observer = new IntersectionObserver(
-      ([entry]) => {
-        if (!entry.isIntersecting) {
-          const headerHeight = `-${headerElement.clientHeight}px`;
-          headerElement.style.setProperty("--top", headerHeight);
-        } else {
-          headerElement.style.setProperty("--top", "0");
-        }
-      },
-      { rootMargin: "300px" }
-    );
-
-    observer.observe(targetElement);
-
-    return () => observer.unobserve(targetElement);
-  }, []);
+  useEffect(() => {}, []);
 
   return { headerRef, scrollHandleRef } as const;

[Survived] BooleanLiteral
header/hooks/use-sticky-header/useStickyHeader.ts:11:9
     const headerElement = headerRef.current;
     const targetElement = scrollHandleRef.current;
 
-    if (!headerElement || !targetElement) {
+    if (headerElement || !targetElement) {
       return;
     }

[Survived] BooleanLiteral
header/hooks/use-sticky-header/useStickyHeader.ts:11:27
     const headerElement = headerRef.current;
     const targetElement = scrollHandleRef.current;
 
-    if (!headerElement || !targetElement) {
+    if (!headerElement || targetElement) {
       return;
     }

[NoCoverage] BlockStatement
header/hooks/use-sticky-header/useStickyHeader.ts:16:20
     }
 
     const observer = new IntersectionObserver(
-      ([entry]) => {
-        if (!entry.isIntersecting) {
-          const headerHeight = `-${headerElement.clientHeight}px`;
-          headerElement.style.setProperty("--top", headerHeight);
-        } else {
-          headerElement.style.setProperty("--top", "0");
-        }
-      },
+      ([entry]) => {},
       { rootMargin: "300px" }
     );

[NoCoverage] BlockStatement
header/hooks/use-sticky-header/useStickyHeader.ts:17:36
 
     const observer = new IntersectionObserver(
       ([entry]) => {
-        if (!entry.isIntersecting) {
-          const headerHeight = `-${headerElement.clientHeight}px`;
-          headerElement.style.setProperty("--top", headerHeight);
-        } else {
+        if (!entry.isIntersecting) {} else {
           headerElement.style.setProperty("--top", "0");
         }

[NoCoverage] BooleanLiteral
header/hooks/use-sticky-header/useStickyHeader.ts:17:13
 
     const observer = new IntersectionObserver(
       ([entry]) => {
-        if (!entry.isIntersecting) {
+        if (entry.isIntersecting) {
           const headerHeight = `-${headerElement.clientHeight}px`;
           headerElement.style.setProperty("--top", headerHeight);

[NoCoverage] BlockStatement
header/hooks/use-sticky-header/useStickyHeader.ts:20:16
         if (!entry.isIntersecting) {
           const headerHeight = `-${headerElement.clientHeight}px`;
           headerElement.style.setProperty("--top", headerHeight);
-        } else {
-          headerElement.style.setProperty("--top", "0");
-        }
+        } else {}
       },
       { rootMargin: "300px" }

[Survived] ArrowFunction
header/hooks/use-sticky-header/useStickyHeader.ts:29:12
 
     observer.observe(targetElement);
 
-    return () => observer.unobserve(targetElement);
+    return () => undefined;
   }, []);
 
