[Survived] BooleanLiteral
src/layouts/intro-banner/IntroBanner.tsx:28:24
           <AppBadge
             variant="danger"
             size="large"
-            isRounded={false}
+            isRounded={true}
             badgeContent={badgeContent}
           />
