[Killed] BlockStatement
src/layouts/page-wrapper/PageWrapper.tsx:12:6
 const PageWrapper = (
   { children, ...props }: PropsWithChildren<AppContainerProps>,
   ref: Ref<HTMLDivElement>
-) => {
-  return (
-    <AppContainer
-      className="spa-page-wrapper"
-      maxWidth="xl"
-      ref={ref}
-      {...props}
-    >
-      {children}
-    </AppContainer>
-  );
-};
+) => {};
 
 export default forwardRef<HTMLDivElement, PropsWithChildren<AppContainerProps>>(
killedBy: BestSellers component Should render bestSellers header
statusReason: TestingLibraryElementError: Unable to find an element with the text: /bestSellers.header/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
