[NoCoverage] BlockStatement
src/layouts/root-layout/RootLayout.tsx:8:26
 
 import "@/layouts/root-layout/RootLayout.scss";
 
-const RootLayout = () => {
-  return (
-    <AppBox className="root-layout">
-      <Header />
-      <AppBox className="root-layout__content">
-        <Outlet />
-      </AppBox>
-      <Footer />
-    </AppBox>
-  );
-};
+const RootLayout = () => {};
 
 export default RootLayout;
