[Killed] BlockStatement
layouts/subintro/components/SubintroItem.tsx:9:64
   icon: string;
 };
 
-const SubintroItem = ({ content, icon }: SubintroItemProps) => {
-  return (
-    <AppBox className="spa-subintro__element" data-testid="spa-subintro-item">
-      <img className="spa-subintro__icon" src={icon} />
-      <AppTypography
-        translationKey={content}
-        variant="subtitle2"
-        className="spa-subintro__content"
-      />
-    </AppBox>
-  );
-};
+const SubintroItem = ({ content, icon }: SubintroItemProps) => {};
 
 export default SubintroItem;
killedBy: Subintro section renders four subintro elements correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spa-subintro-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="spa-subintro MuiBox-root css-0"
    />
