[Killed] BlockStatement
src/layouts/subintro/Subintro.tsx:7:24
 
 import "@/layouts/subintro/Subintro.scss";
 
-const Subintro = () => {
-  return (
-    <AppBox className="spa-subintro">
-      {subintroData.map((element) => (
-        <SubintroItem
-          icon={element.icon}
-          key={element.id}
-          content={element.content}
-        />
-      ))}
-    </AppBox>
-  );
-};
+const Subintro = () => {};
 
 export default Subintro;
killedBy: Subintro section renders four subintro elements correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spa-subintro-item"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/layouts/subintro/Subintro.tsx:10:25
 const Subintro = () => {
   return (
     <AppBox className="spa-subintro">
-      {subintroData.map((element) => (
-        <SubintroItem
-          icon={element.icon}
-          key={element.id}
-          content={element.content}
-        />
-      ))}
+      {subintroData.map(() => undefined)}
     </AppBox>
   );
killedBy: Subintro section renders four subintro elements correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="spa-subintro-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="spa-subintro MuiBox-root css-0"
    />
