[NoCoverage] ArrowFunction
src/pages/home/HomePage.tsx:27:18
         Open
       </AppButton>
       <AppButton
-        onClick={() =>
-          openSnackbar({
-            message: "MOLODETZ DMYTRO",
-            variant: "error"
-          })
+        onClick={() => undefined
         }
       >

[NoCoverage] ObjectLiteral
src/pages/home/HomePage.tsx:28:24
       </AppButton>
       <AppButton
         onClick={() =>
-          openSnackbar({
-            message: "MOLODETZ DMYTRO",
-            variant: "error"
-          })
+          openSnackbar({})
         }
       >
