[NoCoverage] BlockStatement
src/pages/not-found/NotFoundPage.tsx:6:28
 import AppLink from "@/components/app-link/AppLink";
 import AppTypography from "@/components/app-typography/AppTypography";
 
-const NotFoundPage = () => {
-  return (
-    <AppContainer>
-      <AppTypography variant="h1">404 Not Found</AppTypography>
-      <AppButton>
-        <AppLink to="/">Go back</AppLink>
-      </AppButton>
-    </AppContainer>
-  );
-};
+const NotFoundPage = () => {};
 
 export default NotFoundPage;
