[Killed] ConditionalExpression
src/pages/products/ProductsPage.tsx:13:7
   const { data: products, isLoading } = useGetProductsQuery();
 
   //@TODO Create Skeleton for product items
-  if (isLoading) return <AppTypography>Loading...</AppTypography>;
+  if (true) return <AppTypography>Loading...</AppTypography>;
 
   const productCards = products
killedBy: ProductsPage renders the product count correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p
      class="MuiTypography-root MuiTypography-body1 spa-typography spa-typography__body css-ahj2mt-Mu

[Survived] ConditionalExpression
src/pages/products/ProductsPage.tsx:13:7
   const { data: products, isLoading } = useGetProductsQuery();
 
   //@TODO Create Skeleton for product items
-  if (isLoading) return <AppTypography>Loading...</AppTypography>;
+  if (false) return <AppTypography>Loading...</AppTypography>;
 
   const productCards = products

[Survived] MethodExpression
src/pages/products/ProductsPage.tsx:16:7
   if (isLoading) return <AppTypography>Loading...</AppTypography>;
 
   const productCards = products
-    ? products
-        .slice(0, 4)
+    ? products
         .map((product) => <ProductCard key={product.id} product={product} />)
     : null;

[Survived] ArrowFunction
src/pages/products/ProductsPage.tsx:18:14
   const productCards = products
     ? products
         .slice(0, 4)
-        .map((product) => <ProductCard key={product.id} product={product} />)
+        .map(() => undefined)
     : null;
 

[Killed] ConditionalExpression
src/pages/products/ProductsPage.tsx:32:14
         />
         <AppBox className="spa-products-page__info">
           <AppTypography className="spa-products-page__count" component="span">
-            {products?.length || 0}
+            {true}
             <AppTypography
               translationKey="productsItems.label"
killedBy: ProductsPage renders the product count correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiContainer-root MuiContainer-maxWidthXl spa-page-wrapper css-19r6kue-MuiContainer-ro

[Killed] ConditionalExpression
src/pages/products/ProductsPage.tsx:32:14
         />
         <AppBox className="spa-products-page__info">
           <AppTypography className="spa-products-page__count" component="span">
-            {products?.length || 0}
+            {false}
             <AppTypography
               translationKey="productsItems.label"
killedBy: ProductsPage renders the product count correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiContainer-root MuiContainer-maxWidthXl spa-page-wrapper css-19r6kue-MuiContainer-ro
