[NoCoverage] ObjectLiteral
src/routes/routes.tsx:13:3
 import routePaths from "@/constants/routes";
 
 const routes: RouteObject[] = [
-  {
-    path: routePaths.home.path,
-    errorElement: <ErrorPage />,
-    children: [
-      {
-        element: <RootLayout />,
-        children: [
-          { index: true, element: <HomePage /> },
-          { path: routePaths.products.path, element: <ProductsPage /> }
-        ]
-      }
-    ]
-  },
+  {},
   {
     path: routePaths.any.path,

[NoCoverage] BooleanLiteral
src/routes/routes.tsx:20:20
       {
         element: <RootLayout />,
         children: [
-          { index: true, element: <HomePage /> },
+          { index: false, element: <HomePage /> },
           { path: routePaths.products.path, element: <ProductsPage /> }
         ]
