[NoCoverage] ObjectLiteral
src/store/api/appApi.ts:5:29
 import { createApi, fetchBaseQuery } from "@reduxjs/toolkit/query/react";
 
 export const appApi = createApi({
-  baseQuery: fetchBaseQuery({
-    baseUrl: process.env.API_BASE_PATH
-    // credentials: "include"    to avoid cors errors for mock backend
-  }),
+  baseQuery: fetchBaseQuery({}),
   reducerPath: apiNames.app,
   endpoints: () => ({})

[NoCoverage] ArrowFunction
src/store/api/appApi.ts:10:14
     // credentials: "include"    to avoid cors errors for mock backend
   }),
   reducerPath: apiNames.app,
-  endpoints: () => ({})
+  endpoints: () => undefined
 });
 
