[NoCoverage] ArrowFunction
src/store/api/productsApi.ts:10:14
 import { Product } from "@/types/product.types";
 
 const productsApi = appApi.injectEndpoints({
-  endpoints: (build) => ({
-    getProducts: build.query<Product[], void>({
-      query: () => URLS.products.get
-    }),
-    addProduct: build.mutation<
-      Product,
-      Pick<Product, "name" | "description" | "price">
-    >({
-      query: (productData) => ({
-        url: URLS.products.post,
-        method: httpMethods.post,
-        body: productData
-      })
-    }),
-    deleteProduct: build.mutation<Product, string>({
-      query: (id: string) => ({
-        url: createUrlPath(URLS.products.delete, id),
-        method: httpMethods.delete
-      })
-    })
-  })
+  endpoints: () => undefined
 });
 

[NoCoverage] ObjectLiteral
src/store/api/productsApi.ts:11:47
 
 const productsApi = appApi.injectEndpoints({
   endpoints: (build) => ({
-    getProducts: build.query<Product[], void>({
-      query: () => URLS.products.get
-    }),
+    getProducts: build.query<Product[], void>({}),
     addProduct: build.mutation<
       Product,

[NoCoverage] ArrowFunction
src/store/api/productsApi.ts:12:14
 const productsApi = appApi.injectEndpoints({
   endpoints: (build) => ({
     getProducts: build.query<Product[], void>({
-      query: () => URLS.products.get
+      query: () => undefined
     }),
     addProduct: build.mutation<

[NoCoverage] ObjectLiteral
src/store/api/productsApi.ts:17:7
     addProduct: build.mutation<
       Product,
       Pick<Product, "name" | "description" | "price">
-    >({
-      query: (productData) => ({
-        url: URLS.products.post,
-        method: httpMethods.post,
-        body: productData
-      })
-    }),
+    >({}),
     deleteProduct: build.mutation<Product, string>({
       query: (id: string) => ({

[NoCoverage] ArrowFunction
src/store/api/productsApi.ts:18:14
       Product,
       Pick<Product, "name" | "description" | "price">
     >({
-      query: (productData) => ({
-        url: URLS.products.post,
-        method: httpMethods.post,
-        body: productData
-      })
+      query: () => undefined
     }),
     deleteProduct: build.mutation<Product, string>({

[NoCoverage] ObjectLiteral
src/store/api/productsApi.ts:24:52
         body: productData
       })
     }),
-    deleteProduct: build.mutation<Product, string>({
-      query: (id: string) => ({
-        url: createUrlPath(URLS.products.delete, id),
-        method: httpMethods.delete
-      })
-    })
+    deleteProduct: build.mutation<Product, string>({})
   })
 });

[NoCoverage] ArrowFunction
src/store/api/productsApi.ts:25:14
       })
     }),
     deleteProduct: build.mutation<Product, string>({
-      query: (id: string) => ({
-        url: createUrlPath(URLS.products.delete, id),
-        method: httpMethods.delete
-      })
+      query: () => undefined
     })
   })

[NoCoverage] ObjectLiteral
src/store/api/productsApi.ts:25:31
       })
     }),
     deleteProduct: build.mutation<Product, string>({
-      query: (id: string) => ({
-        url: createUrlPath(URLS.products.delete, id),
-        method: httpMethods.delete
-      })
+      query: (id: string) => ({})
     })
   })
