[NoCoverage] BlockStatement
src/store/slices/productsSlice.ts:24:58
   name: sliceNames.products,
   initialState,
   reducers: {
-    setProducts(state, action: PayloadAction<Product[]>) {
-      state.list = action.payload;
-    },
+    setProducts(state, action: PayloadAction<Product[]>) {},
     addProduct(state, action: PayloadAction<Product>) {
       state.list.unshift(action.payload);

[NoCoverage] BlockStatement
src/store/slices/productsSlice.ts:27:55
     setProducts(state, action: PayloadAction<Product[]>) {
       state.list = action.payload;
     },
-    addProduct(state, action: PayloadAction<Product>) {
-      state.list.unshift(action.payload);
-    },
+    addProduct(state, action: PayloadAction<Product>) {},
     removeProduct(state, action: PayloadAction<string>) {
       state.list = state.list.filter(

[NoCoverage] BlockStatement
src/store/slices/productsSlice.ts:30:57
     addProduct(state, action: PayloadAction<Product>) {
       state.list.unshift(action.payload);
     },
-    removeProduct(state, action: PayloadAction<string>) {
-      state.list = state.list.filter(
-        (product) => product.id !== action.payload
-      );
-    },
+    removeProduct(state, action: PayloadAction<string>) {},
     updateProduct(state, action: PayloadAction<Product>) {
       const index = state.list.findIndex(

[NoCoverage] MethodExpression
src/store/slices/productsSlice.ts:31:20
       state.list.unshift(action.payload);
     },
     removeProduct(state, action: PayloadAction<string>) {
-      state.list = state.list.filter(
-        (product) => product.id !== action.payload
-      );
+      state.list = state.list;
     },
     updateProduct(state, action: PayloadAction<Product>) {

[NoCoverage] ArrowFunction
src/store/slices/productsSlice.ts:32:9
     },
     removeProduct(state, action: PayloadAction<string>) {
       state.list = state.list.filter(
-        (product) => product.id !== action.payload
+        () => undefined
       );
     },

[NoCoverage] ConditionalExpression
src/store/slices/productsSlice.ts:32:22
     },
     removeProduct(state, action: PayloadAction<string>) {
       state.list = state.list.filter(
-        (product) => product.id !== action.payload
+        (product) => true
       );
     },

[NoCoverage] BlockStatement
src/store/slices/productsSlice.ts:35:58
         (product) => product.id !== action.payload
       );
     },
-    updateProduct(state, action: PayloadAction<Product>) {
-      const index = state.list.findIndex(
-        (product) => product.id === action.payload.id
-      );
-      if (index !== -1) {
-        state.list[index] = action.payload;
-      }
-    },
+    updateProduct(state, action: PayloadAction<Product>) {},
     setLoading(state) {
       state.status = "loading";

[NoCoverage] ConditionalExpression
src/store/slices/productsSlice.ts:37:22
     },
     updateProduct(state, action: PayloadAction<Product>) {
       const index = state.list.findIndex(
-        (product) => product.id === action.payload.id
+        (product) => false
       );
       if (index !== -1) {

[NoCoverage] ConditionalExpression
src/store/slices/productsSlice.ts:37:22
     },
     updateProduct(state, action: PayloadAction<Product>) {
       const index = state.list.findIndex(
-        (product) => product.id === action.payload.id
+        (product) => true
       );
       if (index !== -1) {

[NoCoverage] ConditionalExpression
src/store/slices/productsSlice.ts:39:11
       const index = state.list.findIndex(
         (product) => product.id === action.payload.id
       );
-      if (index !== -1) {
+      if (true) {
         state.list[index] = action.payload;
       }

[NoCoverage] EqualityOperator
src/store/slices/productsSlice.ts:39:11
       const index = state.list.findIndex(
         (product) => product.id === action.payload.id
       );
-      if (index !== -1) {
+      if (index === -1) {
         state.list[index] = action.payload;
       }

[NoCoverage] BlockStatement
src/store/slices/productsSlice.ts:43:23
         state.list[index] = action.payload;
       }
     },
-    setLoading(state) {
-      state.status = "loading";
-    },
+    setLoading(state) {},
     setError(state, action: PayloadAction<string>) {
       state.status = "failed";

[NoCoverage] BlockStatement
src/store/slices/productsSlice.ts:46:52
     setLoading(state) {
       state.status = "loading";
     },
-    setError(state, action: PayloadAction<string>) {
-      state.status = "failed";
-      state.error = action.payload;
-    },
+    setError(state, action: PayloadAction<string>) {},
     clearError(state) {
       state.error = null;

[NoCoverage] BlockStatement
src/store/slices/productsSlice.ts:50:23
       state.status = "failed";
       state.error = action.payload;
     },
-    clearError(state) {
-      state.error = null;
-    }
+    clearError(state) {}
   }
 });
