[NoCoverage] BlockStatement
src/store/slices/snackbarSlice.ts:28:73
   name: sliceNames.products,
   initialState,
   reducers: {
-    openSnackbar: (state, action: PayloadAction<BaseSnackbarConfig>) => {
-      state.isOpen = true;
-      state.config = action.payload;
-      if (state._timerId) {
-        clearTimeout(state._timerId);
-        state._timerId = null;
-      }
-    },
+    openSnackbar: (state, action: PayloadAction<BaseSnackbarConfig>) => {},
     closeSnackbar: (state) => {
       state.isOpen = false;

[NoCoverage] BooleanLiteral
src/store/slices/snackbarSlice.ts:29:22
   initialState,
   reducers: {
     openSnackbar: (state, action: PayloadAction<BaseSnackbarConfig>) => {
-      state.isOpen = true;
+      state.isOpen = false;
       state.config = action.payload;
       if (state._timerId) {

[NoCoverage] ConditionalExpression
src/store/slices/snackbarSlice.ts:31:11
     openSnackbar: (state, action: PayloadAction<BaseSnackbarConfig>) => {
       state.isOpen = true;
       state.config = action.payload;
-      if (state._timerId) {
+      if (true) {
         clearTimeout(state._timerId);
         state._timerId = null;

[NoCoverage] ConditionalExpression
src/store/slices/snackbarSlice.ts:31:11
     openSnackbar: (state, action: PayloadAction<BaseSnackbarConfig>) => {
       state.isOpen = true;
       state.config = action.payload;
-      if (state._timerId) {
+      if (false) {
         clearTimeout(state._timerId);
         state._timerId = null;

[NoCoverage] BlockStatement
src/store/slices/snackbarSlice.ts:36:31
         state._timerId = null;
       }
     },
-    closeSnackbar: (state) => {
-      state.isOpen = false;
-      if (state._timerId) {
-        clearTimeout(state._timerId);
-        state._timerId = null;
-      }
-    },
+    closeSnackbar: (state) => {},
     setSnackbarTimerId: (
       state,

[NoCoverage] BooleanLiteral
src/store/slices/snackbarSlice.ts:37:22
       }
     },
     closeSnackbar: (state) => {
-      state.isOpen = false;
+      state.isOpen = true;
       if (state._timerId) {
         clearTimeout(state._timerId);

[NoCoverage] ConditionalExpression
src/store/slices/snackbarSlice.ts:38:11
     },
     closeSnackbar: (state) => {
       state.isOpen = false;
-      if (state._timerId) {
+      if (false) {
         clearTimeout(state._timerId);
         state._timerId = null;

[NoCoverage] BlockStatement
src/store/slices/snackbarSlice.ts:38:27
     },
     closeSnackbar: (state) => {
       state.isOpen = false;
-      if (state._timerId) {
-        clearTimeout(state._timerId);
-        state._timerId = null;
-      }
+      if (state._timerId) {}
     },
     setSnackbarTimerId: (

[NoCoverage] BlockStatement
src/store/slices/snackbarSlice.ts:46:10
     setSnackbarTimerId: (
       state,
       action: PayloadAction<ReturnType<typeof setTimeout>>
-    ) => {
-      state._timerId = action.payload;
-    }
+    ) => {}
   }
 });

[NoCoverage] BlockStatement
src/store/slices/snackbarSlice.ts:55:69
 export const { closeSnackbar, openSnackbar } = snackbarSlice.actions;
 
 export const openSnackbarWithTimeout =
-  (config: SnackbarConfigWithTimeout) => (dispatch: AppDispatch) => {
-    dispatch(openSnackbar(config));
-
-    const timerId = setTimeout(() => {
-      dispatch(closeSnackbar());
-    }, config.autohideDuration ?? DEFAULT_AUTOHIDE_DURATION);
-
-    dispatch(snackbarSlice.actions.setSnackbarTimerId(timerId));
-  };
+  (config: SnackbarConfigWithTimeout) => (dispatch: AppDispatch) => {};
 
 export const useIsSnackbarOpenSelector = () =>

[NoCoverage] BlockStatement
src/store/slices/snackbarSlice.ts:58:38
   (config: SnackbarConfigWithTimeout) => (dispatch: AppDispatch) => {
     dispatch(openSnackbar(config));
 
-    const timerId = setTimeout(() => {
-      dispatch(closeSnackbar());
-    }, config.autohideDuration ?? DEFAULT_AUTOHIDE_DURATION);
+    const timerId = setTimeout(() => {}, config.autohideDuration ?? DEFAULT_AUTOHIDE_DURATION);
 
     dispatch(snackbarSlice.actions.setSnackbarTimerId(timerId));

[NoCoverage] LogicalOperator
src/store/slices/snackbarSlice.ts:60:8
 
     const timerId = setTimeout(() => {
       dispatch(closeSnackbar());
-    }, config.autohideDuration ?? DEFAULT_AUTOHIDE_DURATION);
+    }, config.autohideDuration && DEFAULT_AUTOHIDE_DURATION);
 
     dispatch(snackbarSlice.actions.setSnackbarTimerId(timerId));

[NoCoverage] ArrowFunction
src/store/slices/snackbarSlice.ts:66:18
   };
 
 export const useIsSnackbarOpenSelector = () =>
-  useAppSelector((store) => store.snackbar.isOpen);
+  useAppSelector(() => undefined);
 export const useSnackbarConfigSelector = () =>
   useAppSelector((store) => store.snackbar.config);

[NoCoverage] ArrowFunction
src/store/slices/snackbarSlice.ts:68:18
 export const useIsSnackbarOpenSelector = () =>
   useAppSelector((store) => store.snackbar.isOpen);
 export const useSnackbarConfigSelector = () =>
-  useAppSelector((store) => store.snackbar.config);
+  useAppSelector(() => undefined);
 
 export default snackbarSlice.reducer;
