[NoCoverage] ObjectLiteral
src/store/store.ts:9:12
 import { appApi } from "@/store/api/appApi";
 
 export const store = configureStore({
-  reducer: {
-    products: productsReducer,
-    snackbar: snackbarReducer,
-    [appApi.reducerPath]: appApi.reducer
-  },
+  reducer: {},
   middleware: (getDefaultMiddleware) =>
     getDefaultMiddleware().concat(appApi.middleware)

[NoCoverage] ArrowFunction
src/store/store.ts:14:15
     snackbar: snackbarReducer,
     [appApi.reducerPath]: appApi.reducer
   },
-  middleware: (getDefaultMiddleware) =>
-    getDefaultMiddleware().concat(appApi.middleware)
+  middleware: () => undefined
 });
 
