[Killed] BlockStatement
src/utils/cn.ts:1:42
-const cn = (...classNames: unknown[]) => {
-  return classNames
-    .filter((className) => typeof className === "string" && className !== "")
-    .join(" ");
-};
+const cn = (...classNames: unknown[]) => {};
 
 export default cn;
killedBy: AppLink adds active class when link's pathname is equal to location pathname
statusReason: Error: expect(element).toHaveClass("spa-link--active")

Expected the element to have class:
  spa-link--active
Received:

[Survived] MethodExpression
src/utils/cn.ts:2:10
 const cn = (...classNames: unknown[]) => {
-  return classNames
-    .filter((className) => typeof className === "string" && className !== "")
+  return classNames
     .join(" ");
 };

[Killed] ConditionalExpression
src/utils/cn.ts:3:28
 const cn = (...classNames: unknown[]) => {
   return classNames
-    .filter((className) => typeof className === "string" && className !== "")
+    .filter((className) => false)
     .join(" ");
 };
killedBy: AppLink adds active class when link's pathname is equal to location pathname
statusReason: Error: expect(element).toHaveClass("spa-link--active")

Expected the element to have class:
  spa-link--active
Received:

[Killed] EqualityOperator
src/utils/cn.ts:3:28
 const cn = (...classNames: unknown[]) => {
   return classNames
-    .filter((className) => typeof className === "string" && className !== "")
+    .filter((className) => typeof className !== "string" && className !== "")
     .join(" ");
 };
killedBy: AppLink adds active class when link's pathname is equal to location pathname
statusReason: Error: expect(element).toHaveClass("spa-link--active")

Expected the element to have class:
  spa-link--active
Received:
