[Killed] BlockStatement
src/utils/createUrlPath.ts:1:68
-const createQueryParamsString = (query: Record<string, string>) => {
-  const queryParams = new URLSearchParams();
-
-  Object.entries(query).forEach(([key, value]) => {
-    if (value) {
-      queryParams.append(key, value);
-    }
-  });
-
-  return queryParams.toString();
-};
+const createQueryParamsString = (query: Record<string, string>) => {};
 
 export const createUrlPath = (URL: string, params = "", query = {}) => {
killedBy: createUrlPath should join base URL with query parameters correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com?key1=value1&key2=value2"
Received: "https://www.google.com"

[Killed] BlockStatement
src/utils/createUrlPath.ts:4:51
 const createQueryParamsString = (query: Record<string, string>) => {
   const queryParams = new URLSearchParams();
 
-  Object.entries(query).forEach(([key, value]) => {
-    if (value) {
-      queryParams.append(key, value);
-    }
-  });
+  Object.entries(query).forEach(([key, value]) => {});
 
   return queryParams.toString();
killedBy: createUrlPath should join base URL with query parameters correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com?key1=value1&key2=value2"
Received: "https://www.google.com"

[Killed] BlockStatement
src/utils/createUrlPath.ts:5:16
   const queryParams = new URLSearchParams();
 
   Object.entries(query).forEach(([key, value]) => {
-    if (value) {
-      queryParams.append(key, value);
-    }
+    if (value) {}
   });
 
killedBy: createUrlPath should join base URL with query parameters correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com?key1=value1&key2=value2"
Received: "https://www.google.com"

[Killed] ConditionalExpression
src/utils/createUrlPath.ts:5:9
   const queryParams = new URLSearchParams();
 
   Object.entries(query).forEach(([key, value]) => {
-    if (value) {
+    if (true) {
       queryParams.append(key, value);
     }
killedBy: createUrlPath should handle empty query parameters correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com?key2=value2"
Received: "https://www.google.com?key1=&key2=value2"

[Killed] BlockStatement
src/utils/createUrlPath.ts:13:72
   return queryParams.toString();
 };
 
-export const createUrlPath = (URL: string, params = "", query = {}) => {
-  let trimmedUrl = URL;
-  while (trimmedUrl.endsWith("/")) {
-    trimmedUrl = trimmedUrl.slice(0, -1);
-  }
-
-  const queryParams = createQueryParamsString(query);
-  const queryParamsString = queryParams ? `?${queryParams}` : "";
-  const paramsString = params ? `/${params.replace(/^\/+/g, "")}` : "";
-
-  return `${trimmedUrl}${paramsString}${queryParamsString}`;
-};
+export const createUrlPath = (URL: string, params = "", query = {}) => {};
 
killedBy: createUrlPath should join base URL without trailing slash and resource path without trailing slash correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com/products"
Received: undefined

[Killed] ConditionalExpression
src/utils/createUrlPath.ts:15:10
 
 export const createUrlPath = (URL: string, params = "", query = {}) => {
   let trimmedUrl = URL;
-  while (trimmedUrl.endsWith("/")) {
+  while (false) {
     trimmedUrl = trimmedUrl.slice(0, -1);
   }
killedBy: createUrlPath should join base URL with trailing slash and resource path without trailing slash correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com/products"
Received: "https://www.google.com//products"

[Killed] MethodExpression
src/utils/createUrlPath.ts:15:10
 
 export const createUrlPath = (URL: string, params = "", query = {}) => {
   let trimmedUrl = URL;
-  while (trimmedUrl.endsWith("/")) {
+  while (trimmedUrl.startsWith("/")) {
     trimmedUrl = trimmedUrl.slice(0, -1);
   }
killedBy: createUrlPath should join base URL with trailing slash and resource path without trailing slash correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com/products"
Received: "https://www.google.com//products"

[Killed] UnaryOperator
src/utils/createUrlPath.ts:16:38
 export const createUrlPath = (URL: string, params = "", query = {}) => {
   let trimmedUrl = URL;
   while (trimmedUrl.endsWith("/")) {
-    trimmedUrl = trimmedUrl.slice(0, -1);
+    trimmedUrl = trimmedUrl.slice(0, +1);
   }
 
killedBy: createUrlPath should join base URL with trailing slash and resource path without trailing slash correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://www.google.com/products"
Received: "h/products"

[Timeout] MethodExpression
src/utils/createUrlPath.ts:16:18
 export const createUrlPath = (URL: string, params = "", query = {}) => {
   let trimmedUrl = URL;
   while (trimmedUrl.endsWith("/")) {
-    trimmedUrl = trimmedUrl.slice(0, -1);
+    trimmedUrl = trimmedUrl;
   }
 
