[Killed] BlockStatement
src/utils/test-utils.tsx:27:6
     preloadedState,
     ...renderOptions
   }: Partial<ExtendedRenderOptions> = {}
-) => {
-  const store = configureStore({
-    reducer,
-    preloadedState
-  });
-
-  const Wrapper = ({ children }: PropsWithChildren) => (
-    <Provider store={store}>
-      <MemoryRouter initialEntries={initialEntries}>
-        <I18nProivider>
-          <StyledEngineProvider injectFirst>{children}</StyledEngineProvider>
-        </I18nProivider>
-      </MemoryRouter>
-    </Provider>
-  );
-
-  return render(ui, { wrapper: Wrapper, ...renderOptions });
-};
+) => {};
 
killedBy: AppSnackbar renders correctly
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body />

[Killed] ObjectLiteral
src/utils/test-utils.tsx:28:32
     ...renderOptions
   }: Partial<ExtendedRenderOptions> = {}
 ) => {
-  const store = configureStore({
-    reducer,
-    preloadedState
-  });
+  const store = configureStore({});
 
   const Wrapper = ({ children }: PropsWithChildren) => (
killedBy: AppSnackbar renders correctly
statusReason: Error: `reducer` is a required argument, and must be a function or an object of functions that can be passed to combineReducers

[Killed] ArrowFunction
src/utils/test-utils.tsx:33:19
     preloadedState
   });
 
-  const Wrapper = ({ children }: PropsWithChildren) => (
-    <Provider store={store}>
-      <MemoryRouter initialEntries={initialEntries}>
-        <I18nProivider>
-          <StyledEngineProvider injectFirst>{children}</StyledEngineProvider>
-        </I18nProivider>
-      </MemoryRouter>
-    </Provider>
-  );
+  const Wrapper = () => undefined;
 
   return render(ui, { wrapper: Wrapper, ...renderOptions });
killedBy: AppSnackbar renders correctly
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
src/utils/test-utils.tsx:43:21
     </Provider>
   );
 
-  return render(ui, { wrapper: Wrapper, ...renderOptions });
+  return render(ui, {});
 };
 
killedBy: BestSellers component Should render bestSellers header
statusReason: TypeError: Cannot read properties of undefined (reading 'data')
