[Killed] BlockStatement
src/hooks/use-snackbar/useSnackbar.ts:14:27
   SnackbarConfigWithTimeout
 } from "@/types/snackbar.types";
 
-const useSnackbar = () => {
-  const isOpen = useIsSnackbarOpenSelector();
-  const config = useSnackbarConfigSelector();
-  const dispatch = useAppDispatch();
-
-  const openSnackbar = (config: BaseSnackbarConfig) => {
-    dispatch(openSnackbarAction(config));
-  };
-
-  const openSnackbarWithTimeout = (config: SnackbarConfigWithTimeout) => {
-    dispatch(openSnackbarWithTimeoutAction(config));
-  };
-
-  const closeSnackbar = () => {
-    dispatch(closeSnackbarAction());
-  };
-
-  return {
-    isOpen,
-    config,
-    openSnackbar,
-    openSnackbarWithTimeout,
-    closeSnackbar
-  } as const;
-};
+const useSnackbar = () => {};
 
 export default useSnackbar;
killedBy: useSnackbar hook renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'isOpen')

[Killed] BlockStatement
src/hooks/use-snackbar/useSnackbar.ts:19:56
   const config = useSnackbarConfigSelector();
   const dispatch = useAppDispatch();
 
-  const openSnackbar = (config: BaseSnackbarConfig) => {
-    dispatch(openSnackbarAction(config));
-  };
+  const openSnackbar = (config: BaseSnackbarConfig) => {};
 
   const openSnackbarWithTimeout = (config: SnackbarConfigWithTimeout) => {
killedBy: useSnackbar hook calls open snackbar correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0

[Killed] BlockStatement
src/hooks/use-snackbar/useSnackbar.ts:23:74
     dispatch(openSnackbarAction(config));
   };
 
-  const openSnackbarWithTimeout = (config: SnackbarConfigWithTimeout) => {
-    dispatch(openSnackbarWithTimeoutAction(config));
-  };
+  const openSnackbarWithTimeout = (config: SnackbarConfigWithTimeout) => {};
 
   const closeSnackbar = () => {
killedBy: useSnackbar hook calls open snackbar with timeout correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0

[Killed] BlockStatement
src/hooks/use-snackbar/useSnackbar.ts:27:31
     dispatch(openSnackbarWithTimeoutAction(config));
   };
 
-  const closeSnackbar = () => {
-    dispatch(closeSnackbarAction());
-  };
+  const closeSnackbar = () => {};
 
   return {
killedBy: useSnackbar hook calls close snackbar correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined

Number of calls: 0
