[Killed] BlockStatement
src/components/app-box/AppBox.tsx:6:40
 
 type AppBoxProps = BoxProps & ImgHTMLAttributes<HTMLImageElement>;
 
-const AppBox = (props: AppBoxProps) => {
-  return <Box {...props} />;
-};
+const AppBox = (props: AppBoxProps) => {};
 
 export default AppBox;
killedBy: renders Header and Categories components
statusReason: TestingLibraryElementError: Unable to find an element with the text: login.label. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
