[Killed] BlockStatement
src/components/app-button/AppButton.tsx:30:23
   disabled,
   isLoading,
   ...props
-}: AppButtonProps) => {
-  const isDisabled = disabled || isLoading;
-
-  //@TODO: Create a separate component for the loader
-  const loader = isLoading && (
-    <CircularProgress className="spa-loader" size={16} />
-  );
-
-  return (
-    <Button
-      disabled={isDisabled}
-      className={cn(
-        "spa-button",
-        `spa-button__${variant}`,
-        `spa-button__${size}`,
-        className
-      )}
-      {...props}
-    >
-      {children}
-      {loader}
-    </Button>
-  );
-};
+}: AppButtonProps) => {};
 
 export default AppButton;
killedBy: renders Header and Categories components
statusReason: TestingLibraryElementError: Unable to find an element with the text: login.label. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="wrapper MuiBox-root css-0"
    >

[Killed] LogicalOperator
src/components/app-button/AppButton.tsx:34:18
   const isDisabled = disabled || isLoading;
 
   //@TODO: Create a separate component for the loader
-  const loader = isLoading && (
-    <CircularProgress className="spa-loader" size={16} />
-  );
+  const loader = isLoading || <CircularProgress className="spa-loader" size={16} />;
 
   return (
killedBy: AppButton is disabled when isLoading is true
statusReason: Error: Expected test not to call console.error().

If the error is expected, test for it explicitly by mocking it out using jest.spyOn(console, 'error').mockImplementation() and test that the warning occurs.

Warning: Failed prop type: Invalid prop `children` supplied to `ForwardRef(Button)`, expected a ReactNode.

[Killed] ConditionalExpression
src/components/app-button/AppButton.tsx:34:18
   const isDisabled = disabled || isLoading;
 
   //@TODO: Create a separate component for the loader
-  const loader = isLoading && (
-    <CircularProgress className="spa-loader" size={16} />
-  );
+  const loader = true;
 
   return (
killedBy: renders Header and Categories components
statusReason: Error: Expected test not to call console.error().

If the error is expected, test for it explicitly by mocking it out using jest.spyOn(console, 'error').mockImplementation() and test that the warning occurs.

Warning: Failed prop type: Invalid prop `children` supplied to `ForwardRef(Button)`, expected a ReactNode.
