[Killed] BlockStatement
src/components/product-card/ProductCard.tsx:13:56
   product: Product;
 };
 
-const ProductCard = ({ product }: ProductCardProps) => {
-  return (
-    <AppLink key={product.id} to="/">
-      <AppBox className="spa-product-card">
-        <AppBox
-          alt={product.name}
-          className="spa-product-card__img"
-          component="img"
-          src={product.image}
-        />
-        <AppBox>
-          <AppTypography variant="caption">{product.name}</AppTypography>
-          <AppTypography className="spa-product-card__price">
-            {product.price}
-          </AppTypography>
-          <AppTypography className="spa-product-card__description">
-            {product.description}
-          </AppTypography>
-        </AppBox>
-      </AppBox>
-    </AppLink>
-  );
-};
+const ProductCard = ({ product }: ProductCardProps) => {};
 
 export default ProductCard;
killedBy: BestSellers component Should render product cards when data is available
statusReason: Error: Unable to find role="link"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiContainer-root MuiContainer-maxWidthXl spa-best-sellers css-19r6kue-MuiContainer-root"
    >
