[Killed] ArrowFunction
src/layouts/app-footer/AppFooter.tsx:16:49
 import AppBox from "@/components/app-box/AppBox";
 
 const AppFooter = () => {
-  const locationItems = locationFooterItems.map((item) => (
-    <AppBox component="li" className="footer__list-item" key={item.label}>
-      <AppTypography
-        className="footer__list-item-link"
-        translationKey={item.label}
-        component={item.href ? Link : undefined}
-        to={item.href as string}
-      />
-    </AppBox>
-  ));
+  const locationItems = locationFooterItems.map(() => undefined);
 
   const socialsItems = socialsFooterItems.map((item) => (
killedBy: Test Footer component Should render correct number of items in each group
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] ArrowFunction
src/layouts/app-footer/AppFooter.tsx:27:47
     </AppBox>
   ));
 
-  const socialsItems = socialsFooterItems.map((item) => (
-    <AppBox component="li" className="footer__socials-item" key={item.href}>
-      <Link to={item.href}>{item.element}</Link>
-    </AppBox>
-  ));
+  const socialsItems = socialsFooterItems.map(() => undefined);
 
   const customerSupportItems = customerSupportFooterItems.map((item) => (
killedBy: Test Footer component Should render correct number of items in each group
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="/Icon/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <footer
      class="footer MuiBox-root css-0"
    >

[Killed] ArrowFunction
src/layouts/app-footer/AppFooter.tsx:33:63
     </AppBox>
   ));
 
-  const customerSupportItems = customerSupportFooterItems.map((item) => (
-    <AppBox component="li" className="footer__list-item" key={item.label}>
-      <AppTypography
-        className="footer__list-item-link"
-        component={Link}
-        to={item.href}
-        translationKey={item.label}
-      />
-    </AppBox>
-  ));
+  const customerSupportItems = customerSupportFooterItems.map(() => undefined);
 
   const policyItems = policyFooterItems.map((item) => (
killedBy: Test Footer component Should render correct number of items in each group
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArrowFunction
src/layouts/app-footer/AppFooter.tsx:44:45
     </AppBox>
   ));
 
-  const policyItems = policyFooterItems.map((item) => (
-    <AppBox component="li" className="footer__list-item" key={item.label}>
-      <AppTypography
-        className="footer__list-item-link"
-        component={Link}
-        to={item.href}
-        translationKey={item.label}
-      />
-    </AppBox>
-  ));
+  const policyItems = policyFooterItems.map(() => undefined);
 
   return (
killedBy: Test Footer component Should render correct number of items in each group
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1
