[Killed] BlockStatement
src/layouts/app-header/AppHeader.tsx:4:25
 import Header from "@/layouts/app-header/components/header/Header";
 import Categories from "@/layouts/app-header/components/categories/Categories";
 
-const AppHeader = () => {
-  return (
-    <>
-      <Header />
-      <Categories />
-    </>
-  );
-};
+const AppHeader = () => {};
 
 export default AppHeader;
killedBy: renders Header and Categories components
statusReason: TestingLibraryElementError: Unable to find an element with the text: login.label. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
