[Killed] BlockStatement
app-header/components/categories/Categories.tsx:9:26
 
 import "@/layouts/app-header/components/categories/Categories.scss";
 
-const Categories = () => {
-  return (
-    <AppBox className="menu">
-      {categories.map((category, i) => (
-        <AppTypography
-          className="menu__item"
-          key={i}
-          data-testid="menu-item"
-          component={AppLink}
-          to={category.href}
-        >
-          {category.label}
-        </AppTypography>
-      ))}
-    </AppBox>
-  );
-};
+const Categories = () => {};
 
 export default Categories;
killedBy: Categories component render number length of categories
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="menu-item"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
app-header/components/categories/Categories.tsx:12:23
 const Categories = () => {
   return (
     <AppBox className="menu">
-      {categories.map((category, i) => (
-        <AppTypography
-          className="menu__item"
-          key={i}
-          data-testid="menu-item"
-          component={AppLink}
-          to={category.href}
-        >
-          {category.label}
-        </AppTypography>
-      ))}
+      {categories.map(() => undefined)}
     </AppBox>
   );
killedBy: Categories component render number length of categories
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="menu-item"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="menu MuiBox-root css-0"
    />
