[Killed] BlockStatement
src/layouts/page-wrapper/PageWrapper.tsx:10:6
 const PageWrapper = (
   { children, ...rest }: PropsWithChildren<AppContainerProps>,
   ref: Ref<HTMLDivElement>
-) => {
-  return (
-    <AppContainer maxWidth="xl" ref={ref} {...rest}>
-      {children}
-    </AppContainer>
-  );
-};
+) => {};
 
 export default forwardRef<HTMLDivElement, PropsWithChildren<AppContainerProps>>(
killedBy: Test Footer component Should render three sections and links lists
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading"

Here are the accessible roles:

  contentinfo:

  Name "":
  <footer
