[NoCoverage] BlockStatement
src/layouts/root-layout/RootLayout.tsx:5:26
 import AppHeader from "@/layouts/app-header/AppHeader";
 import AppFooter from "@/layouts/app-footer/AppFooter";
 
-const RootLayout = () => {
-  return (
-    <>
-      <AppHeader />
-      <Outlet />
-      <AppFooter />
-    </>
-  );
-};
+const RootLayout = () => {};
 
 export default RootLayout;
