[NoCoverage] BlockStatement
src/main.tsx:12:19
 
 import "@/styles/global.scss";
 
-const App = () => {
-  return (
-    <Provider store={store}>
-      <StyledEngineProvider injectFirst>
-        <I18nProivider>
-          <RouterProvider router={createBrowserRouter(routes)} />
-        </I18nProivider>
-      </StyledEngineProvider>
-    </Provider>
-  );
-};
+const App = () => {};
 
 const domNode = document.getElementById("app") as HTMLElement;
