[NoCoverage] ObjectLiteral
src/messages.ts:13:7
     ...bannerMessages.en,
     ...bestSellersMessages.en
   },
-  uk: {
-    ...commonMessages.uk,
-    ...footerMessages.uk,
-    ...bannerMessages.uk,
-    ...bestSellersMessages.uk
-  }
+  uk: {}
 };
 
