[NoCoverage] BlockStatement
src/pages/home/HomePage.tsx:5:24
 import IntroBanner from "@/layouts/intro-banner/IntroBanner";
 import PageWrapper from "@/layouts/page-wrapper/PageWrapper";
 
-const HomePage = () => {
-  return (
-    <>
-      <IntroBanner />
-      <BestSellers />
-      <PageWrapper>Content</PageWrapper>
-    </>
-  );
-};
+const HomePage = () => {};
 
 export default HomePage;
