[NoCoverage] BlockStatement
src/pages/products/ProductsPage.tsx:3:28
 import PageWrapper from "@/layouts/page-wrapper/PageWrapper";
 
-const ProductsPage = () => {
-  return <PageWrapper>Products</PageWrapper>;
-};
+const ProductsPage = () => {};
 
 export default ProductsPage;
