[NoCoverage] ObjectLiteral
src/store/store.ts:7:37
 import productsReducer from "@/store/slices/productsSlice"; 
 import { appApi } from "@/store/api/appApi";
 
-export const store = configureStore({
-  reducer: {
-    products: productsReducer, 
-    [appApi.reducerPath]: appApi.reducer
-  },
-  middleware: (getDefaultMiddleware) =>
-    getDefaultMiddleware().concat(appApi.middleware)
-});
+export const store = configureStore({});
 
 setupListeners(store.dispatch);
