[Killed] BlockStatement
src/utils/test-utils.tsx:21:6
 export const renderWithProviders = (
   ui: ReactElement,
   { preloadedState, ...renderOptions }: Partial<ExtendedRenderOptions> = {}
-) => {
-  const store = configureStore({
-    reducer,
-    preloadedState
-  });
-
-  const Wrapper = ({ children }: PropsWithChildren) => (
-    <Provider store={store}>
-      <BrowserRouter>
-        <StyledEngineProvider injectFirst>{children}</StyledEngineProvider>
-      </BrowserRouter>
-    </Provider>
-  );
-
-  return render(ui, { wrapper: Wrapper, ...renderOptions });
-};
+) => {};
 
killedBy: BestSellers component Should render bestSellers header
statusReason: TestingLibraryElementError: Unable to find an element with the text: /bestSellers.header/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body />

[Killed] ArrowFunction
src/utils/test-utils.tsx:27:19
     preloadedState
   });
 
-  const Wrapper = ({ children }: PropsWithChildren) => (
-    <Provider store={store}>
-      <BrowserRouter>
-        <StyledEngineProvider injectFirst>{children}</StyledEngineProvider>
-      </BrowserRouter>
-    </Provider>
-  );
+  const Wrapper = () => undefined;
 
   return render(ui, { wrapper: Wrapper, ...renderOptions });
killedBy: BestSellers component Should render bestSellers header
statusReason: TestingLibraryElementError: Unable to find an element with the text: /bestSellers.header/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
